Revit 2027 API
ScheduleDefinition.CanFilterByValue Method
 Checks whether a field can be used with a value-based filter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanFilterByValue(
	ScheduleFieldId fieldId
)
Public Function CanFilterByValue (
	fieldId As ScheduleFieldId
) As Boolean
public:
bool CanFilterByValue(
	ScheduleFieldId^ fieldId
)
member CanFilterByValue :
        fieldId : ScheduleFieldId -> bool
Parameters
fieldId ScheduleFieldId
 The ID of the field to check.
Return Value
Boolean
 True if the field can be used with a value based filter, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  fieldId is not the ID of a field in this ScheduleDefinition.
ArgumentNullException |  A non-optional argument was null
Remarks
The value-based filter types are Equal, NotEqual, GreaterThan, GreaterThanOrEqual, LessThan and LessThanOrEqual.
Only certain types of parameters can be filtered by value.
Note that some fields (for example, Workset, Family, Type, Family and Type) only support Equal, NotEqual, but not GreaterThan, GreaterThanOrEqual, LessThan and LessThanOrEqual.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace